
# Напишите программу, которая считывает со стандартного ввода целые числа,
# по одному числу в строке, и после первого введенного нуля выводит сумму
# полученных на вход чисел.

s = 0
while True:
    a = int(input())
    i = a
    s += i
    if a == 0:
        break
print(s)
