
# Напишите программу, которая вычисляет процентное содержание символов G
# (гуанин) и C (цитозин) в введенной строке (программа не должна зависеть
# от регистра вводимых символов).

s = input()
a = s.upper().count('c'.upper())
b = s.upper().count('g'.upper())
c = len(s)
print(((a + b) / c) * 100)
