
# Напишите программу, на вход которой подаётся список чисел одной строкой.
# Программа должна для каждого элемента этого списка вывести сумму двух
# его соседей. Для элементов списка, являющихся крайними, одним из соседей
# считается элемент, находящий на противоположном конце этого списка.
# Например, если на вход подаётся список "1 3 5 6 10", то на выход
# ожидается список "13 6 9 15 7" (без кавычек).

# Если на вход пришло только одно число, надо вывести его же.

# Вывод должен содержать одну строку с числами нового списка, разделёнными
# пробелом.

a = [int(i) for i in input().split()]
b = []
l = len(a) - 1
c = 0
i = 0
if len(a) == 0:
    print(str(0))
else:
    for s1 in a:
        if len(a) > 1:
            if i == 0:
                c = a[i + 1] + a[-1]
                b.append(c)
            elif i > 0 and i < l:
                c = a[i - 1] + a[i + 1]
                b.append(c)
            elif i == l:
                c = a[i - 1] + a[0]
                b.append(c)
        elif len(a) == 1:
            c = a[i]
            b.append(c)
        i += 1
    j = 0
    for s2 in b:
        print(str(b[j]) + ' ', end='')
        j += 1
