
# Напишите программу, которая принимает на вход список чисел в одной
# строке и выводит на экран в одну строку значения, которые повторяются в
# нём более одного раза.

# Для решения задачи может пригодиться метод sort списка.

# Выводимые числа не должны повторяться, порядок их вывода может быть
# произвольным.

a = [int(i) for i in input().split()]
x = set(a)
t = []
for i in x:
    if (a.count(i) > 1):
        t.append(i)
print(*t)
