
# Напишите программу, которая считывает список чисел lst из первой
# строки и число xx из второй строки, которая выводит все позиции, на
# которых встречается число xx в переданном списке lst.

# Позиции нумеруются с нуля, если число xx не встречается в списке,
# вывести строку "Отсутствует" (без кавычек, с большой буквы).

# Позиции должны быть выведены в одну строку, по возрастанию абсолютного
# значения.

a = [int(i) for i in input().split()]
b = int(input())
t = []
ind = 0
if b in a:
    for x in a:
        if x == b:
            t.append(ind)
        ind += 1
        t.sort()
    print(*t)
else:
    print('Отсутствует')
