
# Напишите программу, на вход которой подаётся прямоугольная матрица в
# виде последовательности строк, заканчивающихся строкой, содержащей
# только строку "end" (без кавычек)

# Программа должна вывести матрицу того же размера, у которой каждый
# элемент в позиции i, j равен сумме элементов первой матрицы на позициях
# (i-1, j), (i+1, j), (i, j-1), (i, j+1). У крайних символов соседний
# элемент находится с противоположной стороны матрицы.

# В случае одной строки/столбца элемент сам себе является соседом по
# соответствующему направлению.

m = []
while True:
    a = input()
    if a == 'end':
        break
    m.append([int(s) for s in a.split()])
di, dj = len(m), len(m[0])
new = [[sum([m[i - 1][j], m[(i + 1) % di][j], m[i][j - 1], m[i][(j + 1) % dj]])
        for j in range(dj)] for i in range(di)]
for i in range(di):
    for j in range(dj):
        print(new[i][j], end=' ')
    print()
