
# Напишите программу, которая считывает из файла строку, соответствующую тексту, сжатому с помощью кодирования повторов, и производит обратную операцию, получая исходный текст.

# Запишите полученный текст в файл и прикрепите его, как ответ на это задание.

# В исходном тексте не встречаются цифры, так что код однозначно интерпретируем.


import re

with open('dataset_3363_2.txt', 'r+') as f:
    a = re.split(r"(\d+)", f.readline())[:-1]
    result = ''.join([y * int(x) for x, y in zip(a[1::2], a[::2])])
    print(result)
    f.seek(0)
    f.write(result)
