
# Имеется файл с данными по успеваемости абитуриентов. Он представляет из
# себя набор строк, где в каждой строке записана следующая информация:

# Фамилия;Оценка_по_математике;Оценка_по_физике;Оценка_по_русскому_языку

# Поля внутри строки разделены точкой с запятой, оценки — целые числа.

# Напишите программу, которая считывает файл с подобной структурой и для
# каждого абитуриента выводит его среднюю оценку по этим трём предметам на
# отдельной строке, соответствующей этому абитуриенту.

# Также в конце файла, на отдельной строке, через пробел запишите средние
# баллы по математике, физике и русскому языку по всем абитуриентам.

# В качестве ответа на задание прикрепите полученный файл со средними оценками.

lines = []
with open(r"dataset_3363_4.txt", "rt", encoding="utf-8") as f:
    for line in map(str.strip, f):
        line = tuple(map(int, line.split(";")[1:]))
        print(sum(line) / len(line))
        lines.append(line)
count = len(lines)
for value in (sum(_) / count for _ in zip(*lines)):
    print(value, end=" ")
print()
