
# Напишите программу, которая умеет шифровать и расшифровывать шифр
# подстановки. Программа принимает на вход две строки одинаковой длины, на
# первой строке записаны символы исходного алфавита, на второй строке —
# символы конечного алфавита, после чего идёт строка, которую нужно
# зашифровать переданным ключом, и ещё одна строка, которую нужно
# расшифровать.

# Пусть, например, на вход программе передано:
# abcd
# *d%#
# abacabadaba
# #*%*d*%

key, value, str1, str2 = list(input()), list(
    input()), list(input()), list(input())
for i in str1:  # Для каждой буквы списка str1, выводим то значение Value,которое соответствует Key
    print(value[key.index(i)], end='')
print()
for j in str2:  # Для каждой буквы списка str2, выводим то значение Key,которое соответствует Value
    print(key[value.index(j)], end='')
print()
