
# Жители страны Малевии часто экспериментируют с планировкой комнат. Комнаты бывают треугольные, прямоугольные и круглые. Чтобы быстро вычислять жилплощадь, требуется написать программу, на вход которой подаётся тип фигуры комнаты и соответствующие параметры, которая бы выводила площадь получившейся комнаты.
# Для числа π в стране Малевии используют значение 3.14.

k = input()

if k == 'треугольник':
    a = int(input())
    b = int(input())
    c = int(input())

    p = (a + b + c) / 2
    s = (p * (p - a) * (p - b) * (p - c))
    print(pow(s, 0.5))

elif k == 'прямоугольник':
    a = int(input())
    b = int(input())
    s = a * b
    print(float(s))

elif k == 'круг':
    r = int(input())
    print(3.14 * r**2)
